let rolemap = externaldata(Role_Name:string, Role:string)[
@"https://raw.githubusercontent.com/y0uf0ol/helferchen/main/entra_id_role_map.csv"]
with(format="csv", ignoreFirstRecord=True);
AuditLogs
| where TimeGenerated > startofmonth(now(),-1)
| where AADOperationType == "ActivateRole"
| extend Role = tostring(parse_json(AdditionalDetails.[0].value))
| join kind=leftouter (rolemap) on Role
| summarize min(TimeGenerated) by Identity, ResultDescription, Role_Name
